SimpleConf/src/Documents/ДокументПродажи/ДокументПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументПродажи</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SimpleConf/src/Documents/ДокументПродажи/Forms/ФормаДокумента/Module.bsl
&AtClient
Procedure ТоварыКоличествоOnChange(Item)
	ПересчитатьСуммуСтроки(Элементы.Товары.ТекущиеДанные);
EndProcedure

&AtClient
Procedure ТоварыЦенаOnChange(Item)
	ПересчитатьСуммуСтроки(Элементы.Товары.ТекущиеДанные);
EndProcedure

&AtClient
Procedure ПересчитатьСуммуСтроки(ТекСтрока)
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
	Object.СуммаДокумента = Object.Товары.Total("Сумма");
EndProcedure
